<?php
    $h1 = 'H1';
    $title = 'Title';
    $year = date('Y');
?>
<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title><?php echo $title; ?></title>
</head>
<body>
<!-- четвертое задание -->
<H1><?php echo $h1; ?></H1>
<span><?php echo $year; ?></span>
<script>
/* третье задание
<?php
    $a = 5;
    $b = '05';
    var_dump($a == $b);         // оператор сравнения приводит значения в один тип и сравнивает их, после чего выражение верно
    var_dump((int)'012345');     // integer преобразует строку в число и показывает ее как число
    var_dump((float)123.0 === (int)123.0); // после преобразования в типы числа сравниваются по значению и по типу, поэтому false, т.к. типы разные
    var_dump((int)0 === (int)'hello, world'); // после преобразования в типы числа сравниваются по значению и по типу, поэтому true, т.к. типы одинаковые и значения тоже
?> */
        
/* пятое задание */       
/* $a = 1;
$b = 2;
$a = a + b;
$b = a - b;
$a = a - b; */
</script>

</body>
